package jdbc.ex;

public class Ex5 {
     /*
    [연습문제1]
    앞에서 구현한 게시판에서 다음 내용과 같이 새 사용자를 가입하기 기능을 추가해보세요.

    [실행내용]
    1. 메인 메뉴에 '4.]oin' 메뉴를 다음과 같이 추가한다.

    ```
    메인메뉴: 1.Create | 2.Read | 3.Clear | 4.Join | 5.Exit
    메뉴선택:
    ```

    2. '4.Join' 메뉴를 선택했을 때 새 사용자 정보를 입력받도록 하고. 보조 메뉴를 다음과 같이 출력한다.
    ```
    [새 사용자 입력]
    아이디: java
    이름 : 김자바
    비밀번호: 12345
    나이 : 26
    이메일 : java@mycompany.com

    -------------------------------------------------------------------
    보조메뉴: 1.Ok | 2.Cancel
    메뉴선택: 2
    ```

    3. User 클래스를 선언하고, 입력된 새 사용자 정보를 User 객체 에 저장한다.

    4. 보조 메뉴에서 '1.Ok'를 선택하면 새 사용자는 데이터베이스 users 데이블에 저장된다.
    성공적으로 가입되면 다시 목록으로 되돌아온다.

    5. 보조 메뉴에서 '2.Cancel'을 선택하면 새 사용자 정보를 무시하고 다시 목록으로 되돌아온다.
     */
}
